app/controllers/estudios_complementarios_controller.rb

  def index
    @estudios_complementarios = EstudiosComplementario.all
---
SELECT "estudios_complementarios".* FROM "estudios_complementarios"

  def create
    @estudios_complementario = EstudiosComplementario.new(estudios_complementario_params)
    @estudios_complementario.save
---
INSERT INTO "estudios_complementarios" ("created_at", "entidad", "nombre", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-08-19 16:59:58.291544"], ["entidad", "dasdas"], ["nombre", "sdaas"], ["updated_at", "2015-08-19 16:59:58.291544"], ["usuario_id", 0]]

  def update
    @estudios_complementario.update(estudios_complementario_params)
---
UPDATE "estudios_complementarios" SET "entidad" = $1, "updated_at" = $2 WHERE "estudios_complementarios"."id" = 1  [["entidad", "dasdasasdasdas"], ["updated_at", "2015-08-20 12:34:30.723285"]]

    def set_estudios_complementario
      @estudios_complementario = EstudiosComplementario.find(params[:id])
---
SELECT  "estudios_complementarios".* FROM "estudios_complementarios"  WHERE "estudios_complementarios"."id" = $1 LIMIT 1  [["id", 1]]