app/controllers/profesiones_usuarios_controller.rb

SELECT "profesiones_usuarios".* FROM "profesiones_usuarios"
---
  def index
    @profesiones_usuarios = ProfesionesUsuario.all

SELECT  "profesiones_usuarios".* FROM "profesiones_usuarios"  WHERE "profesiones_usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @profesiones_usuario = ProfesionesUsuario.find(params[:id])

SELECT  "profesiones_usuarios".* FROM "profesiones_usuarios"  WHERE "profesiones_usuarios"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @profesiones_usuario = ProfesionesUsuario.find(params[:id])

INSERT INTO "profesiones_usuarios" ("created_at", "profesion_id", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-08-19 20:31:13.656018"], ["profesion_id", 11], ["updated_at", "2015-08-19 20:31:13.656018"], ["usuario_id", 11]]
---
  def create
    @profesiones_usuario = ProfesionesUsuario.new(profesiones_usuario_params)
    render :action => :new unless @profesiones_usuario.save

SELECT  "profesiones_usuarios".* FROM "profesiones_usuarios"  WHERE "profesiones_usuarios"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "profesiones_usuarios" SET "profesion_id" = $1, "updated_at" = $2, "usuario_id" = $3 WHERE "profesiones_usuarios"."id" = 2  [["profesion_id", 11111], ["updated_at", "2015-08-19 20:32:20.064183"], ["usuario_id", 11111]]
---
  def update
    @profesiones_usuario = ProfesionesUsuario.find(params[:id])
    render :action => :edit unless @profesiones_usuario.update_attributes(profesiones_usuario_params)