app/controllers/referencias_personales_controller.rb

  def index
    @referencias_personales = ReferenciasPersonale.all
---
SELECT "referencias_personales".* FROM "referencias_personales"

  def create
    @referencias_personale = ReferenciasPersonale.new(referencias_personale_params)
    @referencias_personale.save
---
INSERT INTO "referencias_personales" ("created_at", "nombre", "profesion", "telefono", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-08-19 21:56:15.584267"], ["nombre", "adsa"], ["profesion", "asdasdas"], ["telefono", "asdasdasd"], ["updated_at", "2015-08-19 21:56:15.584267"], ["usuario_id", 12312]]

  def update
    @referencias_personale.update(referencias_personale_params)
---
UPDATE "referencias_personales" SET "nombre" = $1, "updated_at" = $2 WHERE "referencias_personales"."id" = 1  [["nombre", "adsa11211"], ["updated_at", "2015-08-19 21:56:41.730686"]]

    def set_referencias_personale
      @referencias_personale = ReferenciasPersonale.find(params[:id])
---
SELECT  "referencias_personales".* FROM "referencias_personales"  WHERE "referencias_personales"."id" = $1 LIMIT 1  [["id", 1]]